<?php
//这是给手机端的询价配置参数，计算询价，放在这里不合适，试验一下模块配置
return [
    'min_base_records'              =>  100,            //单次查询最少的挂牌记录,才能做询价分析
    'select_records_per_time'       =>  300000,         //每次查询，以30万为单位递增
    'std_times'                     =>  1.5,            //设定清洗数据时标准差的倍数
    'max_sale'                      =>  63000,          //最大的挂牌价
    'max_evaluation'                =>  50000,          //最大挂牌价对应的评估价   79%
    'max_position'                  =>  3,              //最大挂牌价对应的二手房评估价所在的位置，3表示从最小值往上3%
    'min_sale'                      =>  15000,           //最小的挂牌价
    'min_evaluation'                =>  12750,           //最小挂牌价对应的评估价 这个是90%
    'min_position'                  =>  18,             //最小挂牌价对应的二手房评估价所在位置，25表示
    'deal_max_position'             =>  25,              //二手房最大价值不得超过25%的挂牌价,最小是0，不用设置
    'deal_discount'                 =>  0.9,            //当有成交价时，先给成交价打个折
    'X'                             => 75,              //竖向的盒须图，在左侧留出%给直方图用
    'box_width'                     =>5,                //盒须图本身的宽度        
    'Y_padding'                     =>5,                //相当于top_padding
    'barChart_num'                  =>30,               //直方图的数量
];